Merge pull request #41 from Matrixbirds/main
chore: using mermaid illustrate How It Works
